---
kind: other
id: Methods.T:Autodesk.Revit.DB.RoutingConditions
source: html/d57e1c96-b583-4f80-bc7a-98d96aacde73.htm
---
# RoutingConditions Methods

Appends a routing condition to the end of existing routing conditions. Note that the first item (indexed at 0) is the condition for the primary connector.